<a href="https://colab.research.google.com/github/Abhinav0057/test/blob/master/dataMiningProject.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [80]:
import pandas as pd
import numpy as np
from matplotlib import pyplot as plt

In [81]:
url1='https://raw.githubusercontent.com/Abhinav0057/test/master/merolagani.csv'
url2='https://raw.githubusercontent.com/Abhinav0057/test/master/Book1.csv'

In [82]:
df1 = pd.read_csv(url1)
df1.head()

   S.N.        Date     Index  Absolute Change Percentage Change
0     1  2019/05/28  1,305.49             2.53           0.1945%
1     2  2019/05/27  1,302.96             0.34           0.0262%
2     3  2019/05/26  1,302.61           -11.93          -0.9077%
3     4  2019/05/23  1,314.55            -5.08          -0.3853%
4     5  2019/05/22  1,319.63             7.49            0.571%

In [83]:
df2 = pd.read_csv(url2,names=['S.N.','Date','Index','Absolute Change','Percentage Change'])
df2.head()

   S.N.       Date     Index  Absolute Change Percentage Change
0     1  7/13/2021  2,871.04            16.34             0.57%
1     2  7/12/2021  2,854.77           -45.06            -1.55%
2     3  7/11/2021  2,899.82            74.71             2.64%
3     4   7/8/2021  2,824.90            23.76             0.85%
4     5   7/7/2021  2,801.13           -16.97            -0.60%

In [84]:
#a=df1.head(0)
#b=df2.head(0)
print(df1.columns.intersection(df2.columns))
print("Okay we have the same headers now lets commbine and remoe the same data")

Index(['S.N.', 'Date', 'Index', 'Absolute Change', 'Percentage Change'], dtype='object')
Okay we have the same headers now lets commbine and remoe the same data

In [85]:
df2.describe()

             S.N.  Absolute Change
count  500.000000       500.000000
mean   250.500000         3.606500
std    144.481833        26.501208
min      1.000000      -123.340000
25%    125.750000        -6.527500
50%    250.500000         1.620000
75%    375.250000        14.182500
max    500.000000        95.460000

In [86]:
#df1['S.N.']=df1['S.N.']+500
#only run this once or else it shall be more than 500+
if df1['S.N.'][0]==1:
  df1['S.N.']=df1['S.N.']+500
df1['S.N.'].head()

0    501
1    502
2    503
3    504
4    505
Name: S.N., dtype: int64

In [87]:
df1['Date'].head()

0    2019/05/28
1    2019/05/27
2    2019/05/26
3    2019/05/23
4    2019/05/22
Name: Date, dtype: object

In [88]:
df1['Date']=pd.to_datetime(df1['Date'],format='%Y/%m/%d')
df1['Date'].head()

0   2019-05-28
1   2019-05-27
2   2019-05-26
3   2019-05-23
4   2019-05-22
Name: Date, dtype: datetime64[ns]

In [89]:
df2['Date']=pd.to_datetime(df2['Date'])
df2['Date'].head()

0   2021-07-13
1   2021-07-12
2   2021-07-11
3   2021-07-08
4   2021-07-07
Name: Date, dtype: datetime64[ns]

In [90]:
#changing df1 date to meet same structure as df2 Date

In [91]:
df1['S.N.'].head()

0    501
1    502
2    503
3    504
4    505
Name: S.N., dtype: int64

In [92]:
ourFrames=[df2,df1]

In [96]:
resultdf = pd.concat(ourFrames)
resultdf.head()

   S.N.       Date     Index  Absolute Change Percentage Change
0     1 2021-07-13  2,871.04            16.34             0.57%
1     2 2021-07-12  2,854.77           -45.06            -1.55%
2     3 2021-07-11  2,899.82            74.71             2.64%
3     4 2021-07-08  2,824.90            23.76             0.85%
4     5 2021-07-07  2,801.13           -16.97            -0.60%

In [95]:
resultdf.tail()

      S.N.       Date   Index  Absolute Change Percentage Change
1218  1719 2014-02-06  785.78             4.40             0.56%
1219  1720 2014-02-05  781.38             6.47             0.83%
1220  1721 2014-02-04  774.91             5.40              0.7%
1221  1722 2014-02-03  769.51            -6.41            -0.83%
1222  1723 2014-02-02  775.92            -5.54             -0.7%

In [101]:
resultdf.isna().sum()

S.N.                 0
Date                 0
Index                0
Absolute Change      0
Percentage Change    0
dtype: int64

In [103]:
resultdf.describe()

              S.N.  Absolute Change
count  1723.000000      1723.000000
mean    862.000000         1.395119
std     497.531574        19.067584
min       1.000000      -123.340000
25%     431.500000        -6.690000
50%     862.000000         0.030000
75%    1292.500000         8.585000
max    1723.000000        95.460000

In [105]:
resultdf=resultdf.drop_duplicates(subset=['Date'])
resultdf.describe()

              S.N.  Absolute Change
count  1680.000000      1680.000000
mean    870.702381         1.333571
std     500.836234        19.234302
min       1.000000      -123.340000
25%     420.750000        -6.812500
50%     883.500000         0.000000
75%    1303.250000         8.582500
max    1723.000000        95.460000

In [108]:
print(' resultdf will be our working df ')

 resultdf will be our working df